OpenNuvoton/M2354BSP/Library/StdDriver/src/crypto.c
/** @cond HIDDEN_SYMBOLS */

static void *s_pRSABuf;
static uint32_t s_u32RsaOpMode;

typedef enum
{
    BUF_NORMAL,
    BUF_CRT,
    BUF_CRTBYPASS,
    BUF_SCAP,
    BUF_CRT_SCAP,
    BUF_CRTBYPASS_SCAP,
    BUF_KS
} E_RSA_BUF_SEL;

static int32_t CheckRsaBufferSize(uint32_t u32OpMode, uint32_t u32BufSize, uint32_t u32UseKS);

/** @endcond HIDDEN_SYMBOLS */

/* Check the allocated buffer size for RSA operation. */
static int32_t CheckRsaBufferSize(uint32_t u32OpMode, uint32_t u32BufSize, uint32_t u32UseKS)
{
    /* RSA buffer size for MODE_NORMAL, MODE_CRT, MODE_CRTBYPASS, MODE_SCAP, MODE_CRT_SCAP, MODE_CRTBYPASS_SCAP */
    uint32_t s_au32RsaBufSizeTbl[] = {sizeof(RSA_BUF_NORMAL_T), sizeof(RSA_BUF_CRT_T), sizeof(RSA_BUF_CRT_T), \
                                      sizeof(RSA_BUF_SCAP_T), sizeof(RSA_BUF_CRT_SCAP_T), sizeof(RSA_BUF_CRT_SCAP_T), \
                                      sizeof(RSA_BUF_KS_T)
                                     };

    if(u32UseKS)
    {
        if(u32BufSize != s_au32RsaBufSizeTbl[BUF_KS])
            return (-1);
    }
    else
    {
        switch(u32OpMode)
        {
            case RSA_MODE_NORMAL:
                if(u32BufSize != s_au32RsaBufSizeTbl[BUF_NORMAL])
                    return (-1);
                break;
            case RSA_MODE_CRT:
                if(u32BufSize != s_au32RsaBufSizeTbl[BUF_CRT])
                    return (-1);
                break;
            case RSA_MODE_CRTBYPASS:
                if(u32BufSize != s_au32RsaBufSizeTbl[BUF_CRTBYPASS])
                    return (-1);
                break;
            case RSA_MODE_SCAP:
                if(u32BufSize != s_au32RsaBufSizeTbl[BUF_SCAP])
                    return (-1);
                break;
            case RSA_MODE_CRT_SCAP:
                if(u32BufSize != s_au32RsaBufSizeTbl[BUF_CRT_SCAP])
                    return (-1);
                break;
            case RSA_MODE_CRTBYPASS_SCAP:
                if(u32BufSize != s_au32RsaBufSizeTbl[BUF_CRTBYPASS_SCAP])
                    return (-1);
                break;
            default:
                return (-1);
        }
    }

    return 0;
}

/**
  * @brief  Open RSA encrypt/decrypt function.
  * @param[in]  crpt         The pointer of CRYPTO module
  * @param[in]  u32OpMode    RSA operation mode, including:
  *         - \ref RSA_MODE_NORMAL
  *         - \ref RSA_MODE_CRT
  *         - \ref RSA_MODE_CRTBYPASS
  *         - \ref RSA_MODE_SCAP
  *         - \ref RSA_MODE_CRT_SCAP
  *         - \ref RSA_MODE_CRTBYPASS_SCAP
  * @param[in]  u32KeySize is RSA key size, including:
  *         - \ref RSA_KEY_SIZE_1024
  *         - \ref RSA_KEY_SIZE_2048
  *         - \ref RSA_KEY_SIZE_3072
  *         - \ref RSA_KEY_SIZE_4096
  * @param[in]  psRSA_Buf    The pointer of RSA buffer struct. User should declare correct RSA buffer for specific operation mode first.
  *         - \ref RSA_BUF_NORMAL_T      The struct for normal mode
  *         - \ref RSA_BUF_CRT_T         The struct for CRT ( + CRT bypass) mode
  *         - \ref RSA_BUF_SCAP_T        The struct for SCAP mode
  *         - \ref RSA_BUF_CRT_SCAP_T    The struct for CRT ( + CRT bypass) +SCAP mode
  *         - \ref RSA_BUF_KS_T          The struct for using key store
  * @param[in]  u32BufSize is RSA buffer size.
  * @param[in]  u32UseKS is use key store function.
  *         - \ref 0    No use key store function
  *         - \ref 1    Use key store function
  * @return  0    Success.
  * @return  -1   The value of pointer of RSA buffer struct is null.
  */
int32_t RSA_Open(CRPT_T *crpt, uint32_t u32OpMode, uint32_t u32KeySize, \
                 void *psRSA_Buf, uint32_t u32BufSize, uint32_t u32UseKS)
{
    if(psRSA_Buf == 0)
    {
        return (-1);
    }
    if(CheckRsaBufferSize(u32OpMode, u32BufSize, u32UseKS) != 0)
    {
        return (-1);
    }

    s_u32RsaOpMode = u32OpMode;
    s_pRSABuf = psRSA_Buf;
    crpt->RSA_CTL = (u32OpMode) | (u32KeySize << CRPT_RSA_CTL_KEYLENG_Pos);

    return 0;
}

/**
  * @brief  Set the RSA key
  * @param[in]  crpt        The pointer of CRYPTO module
  * @param[in]  Key         The private or public key.
  * @return  0    Success.
  * @return  -1   The value of pointer of RSA buffer struct is null.
  */
int32_t RSA_SetKey(CRPT_T *crpt, char *Key)
{
    if(s_pRSABuf == 0)
    {
        return (-1);
    }
    Hex2Reg(Key, ((RSA_BUF_NORMAL_T *)s_pRSABuf)->au32RsaE);
    crpt->RSA_SADDR[2] = (uint32_t) & ((RSA_BUF_NORMAL_T *)s_pRSABuf)->au32RsaE; /* the public key or private key */

    return 0;
}

/**
  * @brief  Set RSA DMA transfer configuration.
  * @param[in]  crpt         The pointer of CRYPTO module
  * @param[in]  Src   RSA DMA source data
  * @param[in]  n     The modulus for both the public and private keys
  * @param[in]  P     The factor of modulus operation(P) for CRT/SCAP mode
  * @param[in]  Q     The factor of modulus operation(Q) for CRT/SCAP mode
  * @return  0    Success.
  * @return  -1   The value of pointer of RSA buffer struct is null.
  */
int32_t RSA_SetDMATransfer(CRPT_T *crpt, char *Src, char *n, char *P, char *Q)
{
    if(s_pRSABuf == 0)
    {
        return (-1);
    }
    Hex2Reg(Src, ((RSA_BUF_NORMAL_T *)s_pRSABuf)->au32RsaM);
    Hex2Reg(n, ((RSA_BUF_NORMAL_T *)s_pRSABuf)->au32RsaN);

    /* Assign the data to DMA */
    crpt->RSA_SADDR[0] = (uint32_t) & ((RSA_BUF_NORMAL_T *)s_pRSABuf)->au32RsaM; /* plaintext / encrypt data */
    crpt->RSA_SADDR[1] = (uint32_t) & ((RSA_BUF_NORMAL_T *)s_pRSABuf)->au32RsaN; /* the base of modulus operation */
    crpt->RSA_DADDR    = (uint32_t) & ((RSA_BUF_NORMAL_T *)s_pRSABuf)->au32RsaOutput; /* encrypt data / decrypt data */

    if((s_u32RsaOpMode & CRPT_RSA_CTL_CRT_Msk) && (s_u32RsaOpMode & CRPT_RSA_CTL_SCAP_Msk))
    {
        /* For RSA CRT/SCAP mode, two primes of private key */
        Hex2Reg(P, ((RSA_BUF_CRT_SCAP_T *)s_pRSABuf)->au32RsaP);
        Hex2Reg(Q, ((RSA_BUF_CRT_SCAP_T *)s_pRSABuf)->au32RsaQ);

        crpt->RSA_SADDR[3] = (uint32_t) & ((RSA_BUF_CRT_SCAP_T *)s_pRSABuf)->au32RsaP; /* prime P */
        crpt->RSA_SADDR[4] = (uint32_t) & ((RSA_BUF_CRT_SCAP_T *)s_pRSABuf)->au32RsaQ; /* prime Q */

        crpt->RSA_MADDR[0] = (uint32_t) & ((RSA_BUF_CRT_SCAP_T *)s_pRSABuf)->au32RsaTmpCp; /* for storing the intermediate temporary value(Cp) */
        crpt->RSA_MADDR[1] = (uint32_t) & ((RSA_BUF_CRT_SCAP_T *)s_pRSABuf)->au32RsaTmpCq; /* for storing the intermediate temporary value(Cq) */
        crpt->RSA_MADDR[2] = (uint32_t) & ((RSA_BUF_CRT_SCAP_T *)s_pRSABuf)->au32RsaTmpDp; /* for storing the intermediate temporary value(Dp) */
        crpt->RSA_MADDR[3] = (uint32_t) & ((RSA_BUF_CRT_SCAP_T *)s_pRSABuf)->au32RsaTmpDq; /* for storing the intermediate temporary value(Dq) */
        crpt->RSA_MADDR[4] = (uint32_t) & ((RSA_BUF_CRT_SCAP_T *)s_pRSABuf)->au32RsaTmpRp; /* for storing the intermediate temporary value(Rp) */
        crpt->RSA_MADDR[5] = (uint32_t) & ((RSA_BUF_CRT_SCAP_T *)s_pRSABuf)->au32RsaTmpRq; /* for storing the intermediate temporary value(Rq) */

        /* For SCAP mode to store the intermediate temporary value(blind key) */
        crpt->RSA_MADDR[6] = (uint32_t) & ((RSA_BUF_CRT_SCAP_T *)s_pRSABuf)->au32RsaTmpE;
    }
    else if(s_u32RsaOpMode & CRPT_RSA_CTL_CRT_Msk)
    {
        /* For RSA CRT/SCAP mode, two primes of private key */
        Hex2Reg(P, ((RSA_BUF_CRT_T *)s_pRSABuf)->au32RsaP);
        Hex2Reg(Q, ((RSA_BUF_CRT_T *)s_pRSABuf)->au32RsaQ);

        crpt->RSA_SADDR[3] = (uint32_t) & ((RSA_BUF_CRT_T *)s_pRSABuf)->au32RsaP; /* prime P */
        crpt->RSA_SADDR[4] = (uint32_t) & ((RSA_BUF_CRT_T *)s_pRSABuf)->au32RsaQ; /* prime Q */

