OpenNuvoton/M2354BSP/Library/StdDriver/src/crypto.c
        crpt->RSA_MADDR[0] = (uint32_t) & ((RSA_BUF_CRT_T *)s_pRSABuf)->au32RsaTmpCp; /* for storing the intermediate temporary value(Cp) */
        crpt->RSA_MADDR[1] = (uint32_t) & ((RSA_BUF_CRT_T *)s_pRSABuf)->au32RsaTmpCq; /* for storing the intermediate temporary value(Cq) */
        crpt->RSA_MADDR[2] = (uint32_t) & ((RSA_BUF_CRT_T *)s_pRSABuf)->au32RsaTmpDp; /* for storing the intermediate temporary value(Dp) */
        crpt->RSA_MADDR[3] = (uint32_t) & ((RSA_BUF_CRT_T *)s_pRSABuf)->au32RsaTmpDq; /* for storing the intermediate temporary value(Dq) */
        crpt->RSA_MADDR[4] = (uint32_t) & ((RSA_BUF_CRT_T *)s_pRSABuf)->au32RsaTmpRp; /* for storing the intermediate temporary value(Rp) */
        crpt->RSA_MADDR[5] = (uint32_t) & ((RSA_BUF_CRT_T *)s_pRSABuf)->au32RsaTmpRq; /* for storing the intermediate temporary value(Rq) */
    }
    else if(s_u32RsaOpMode & CRPT_RSA_CTL_SCAP_Msk)
    {
        /* For RSA CRT/SCAP mode, two primes of private key */
        Hex2Reg(P, ((RSA_BUF_SCAP_T *)s_pRSABuf)->au32RsaP);
        Hex2Reg(Q, ((RSA_BUF_SCAP_T *)s_pRSABuf)->au32RsaQ);

        crpt->RSA_SADDR[3] = (uint32_t) & ((RSA_BUF_SCAP_T *)s_pRSABuf)->au32RsaP; /* prime P */
        crpt->RSA_SADDR[4] = (uint32_t) & ((RSA_BUF_SCAP_T *)s_pRSABuf)->au32RsaQ; /* prime Q */

        /* For SCAP mode to store the intermediate temporary value(blind key) */
        crpt->RSA_MADDR[6] = (uint32_t) & ((RSA_BUF_SCAP_T *)s_pRSABuf)->au32RsaTmpE;
    }

    return 0;
}

/**
  * @brief  Start RSA encrypt/decrypt
  * @param[in]  crpt        The pointer of CRYPTO module
  * @return None
  */
void RSA_Start(CRPT_T *crpt)
{
    crpt->RSA_CTL |= CRPT_RSA_CTL_START_Msk;
}

/**
  * @brief  Read the RSA output.
  * @param[in]   crpt       The pointer of CRYPTO module
  * @param[out]  Output     The RSA operation output data.
  * @return  0    Success.
  * @return  -1   The value of pointer of RSA buffer struct is null.
  */
int32_t RSA_Read(CRPT_T *crpt, char *Output)
{
    if(s_pRSABuf == 0)
    {
        return (-1);
    }
    uint32_t au32CntTbl[4] = {256, 512, 768, 1024}; /* count is key length divided by 4 */
    uint32_t u32CntIdx = 0;

    u32CntIdx = (crpt->RSA_CTL & CRPT_RSA_CTL_KEYLENG_Msk) >> CRPT_RSA_CTL_KEYLENG_Pos;
    Reg2Hex((int32_t)au32CntTbl[u32CntIdx], ((RSA_BUF_NORMAL_T *)s_pRSABuf)->au32RsaOutput, Output);

    return 0;
}

/**
  * @brief  Set the RSA key is read from key store
  * @param[in]  crpt           The pointer of CRYPTO module
  * @param[in]  u32KeyNum      The number of private or public key in key store.
  * @param[in]  u32KSMemType   The key is read from selected memory type of key store. It could be:
                            \ref KS_SRAM
                            \ref KS_FLASH
                            \ref KS_OTP
  * @param[in]  u32BlindKeyNum  The number of blind key in SRAM of key store for SCAP mode. This key is un-readable.
  * @return  0    Success.
  * @return  -1   The value of pointer of RSA buffer struct is null.
  */
int32_t RSA_SetKey_KS(CRPT_T *crpt, uint32_t u32KeyNum, uint32_t u32KSMemType, uint32_t u32BlindKeyNum)
{
    if(s_u32RsaOpMode & CRPT_RSA_CTL_SCAP_Msk)
    {
        crpt->RSA_KSCTL = (u32BlindKeyNum << 8) | (u32KSMemType << CRPT_RSA_KSCTL_RSSRC_Pos) | CRPT_RSA_KSCTL_RSRC_Msk | u32KeyNum;
    }
    else
    {
        crpt->RSA_KSCTL = (u32KSMemType << CRPT_RSA_KSCTL_RSSRC_Pos) | CRPT_RSA_KSCTL_RSRC_Msk | u32KeyNum;
    }
    return 0;
}

/**
  * @brief  Set RSA DMA transfer configuration while using key store.
  * @param[in]  crpt         The pointer of CRYPTO module
  * @param[in]  u32OpMode    RSA operation mode, including:
  *         - \ref RSA_MODE_NORMAL
  *         - \ref RSA_MODE_CRT
  *         - \ref RSA_MODE_CRTBYPASS
  *         - \ref RSA_MODE_SCAP
  *         - \ref RSA_MODE_CRT_SCAP
  *         - \ref RSA_MODE_CRTBYPASS_SCAP
  * @param[in]  Src   RSA DMA source data
  * @param[in]  n     The modulus for both the public and private keys
  * @param[in]  u32PNum         The number of the factor of modulus operation(P) in SRAM of key store for CRT/SCAP mode
  * @param[in]  u32QNum         The number of the factor of modulus operation(Q) in SRAM of key store for CRT/SCAP mode
  * @param[in]  u32CpNum        The number of Cp in SRAM of key store for CRT mode
  * @param[in]  u32CqNum        The number of Cq in SRAM of key store for CRT mode
  * @param[in]  u32DpNum        The number of Dp in SRAM of key store for CRT mode
  * @param[in]  u32DqNum        The number of Dq in SRAM of key store for CRT mode
  * @param[in]  u32RpNum        The number of Rp in SRAM of key store for CRT mode
  * @param[in]  u32RqNum        The number of Rq in SRAM of key store for CRT mode
  * @return  0    Success.
  * @return  -1   The value of pointer of RSA buffer struct is null.
  * @note P, Q, Dp, Dq are equal to half key length. Cp, Cq, Rp, Rq, Blind key are equal to key length.
  */
int32_t RSA_SetDMATransfer_KS(CRPT_T *crpt, char *Src, char *n, uint32_t u32PNum,
                              uint32_t u32QNum, uint32_t u32CpNum, uint32_t u32CqNum, uint32_t u32DpNum,
                              uint32_t u32DqNum, uint32_t u32RpNum, uint32_t u32RqNum)
{
    if(s_pRSABuf == 0)
    {
        return (-1);
    }
    Hex2Reg(Src, ((RSA_BUF_KS_T *)s_pRSABuf)->au32RsaM);
    Hex2Reg(n, ((RSA_BUF_KS_T *)s_pRSABuf)->au32RsaN);

    /* Assign the data to DMA */
    crpt->RSA_SADDR[0] = (uint32_t) & ((RSA_BUF_KS_T *)s_pRSABuf)->au32RsaM; /* plaintext / encrypt data */
    crpt->RSA_SADDR[1] = (uint32_t) & ((RSA_BUF_KS_T *)s_pRSABuf)->au32RsaN; /* the base of modulus operation */
    crpt->RSA_DADDR    = (uint32_t) & ((RSA_BUF_KS_T *)s_pRSABuf)->au32RsaOutput; /* encrypt data / decrypt data */

    if((s_u32RsaOpMode & CRPT_RSA_CTL_CRT_Msk) || (s_u32RsaOpMode & CRPT_RSA_CTL_SCAP_Msk))
    {
        /* For RSA CRT/SCAP mode, two primes of private key */
        crpt->RSA_KSSTS[0] = (crpt->RSA_KSSTS[0] & (~(CRPT_RSA_KSSTS0_NUM0_Msk | CRPT_RSA_KSSTS0_NUM1_Msk))) | \
                             (u32PNum << CRPT_RSA_KSSTS0_NUM0_Pos) | (u32QNum << CRPT_RSA_KSSTS0_NUM1_Pos);

