OpenNuvoton/M2354BSP/Library/StdDriver/src/crypto.c
    }
    if(s_u32RsaOpMode & CRPT_RSA_CTL_CRT_Msk)
    {
        /* For RSA CRT mode, Cp, Cq, Dp, Dq, Rp, Rq */
        crpt->RSA_KSSTS[0] = (crpt->RSA_KSSTS[0] & (~(CRPT_RSA_KSSTS0_NUM2_Msk | CRPT_RSA_KSSTS0_NUM3_Msk))) | \
                             (u32CpNum << CRPT_RSA_KSSTS0_NUM2_Pos) | (u32CqNum << CRPT_RSA_KSSTS0_NUM3_Pos);
        crpt->RSA_KSSTS[1] = (u32DpNum << CRPT_RSA_KSSTS1_NUM4_Pos) | (u32DqNum << CRPT_RSA_KSSTS1_NUM5_Pos) | \
                             (u32RpNum << CRPT_RSA_KSSTS1_NUM6_Pos) | (u32RqNum << CRPT_RSA_KSSTS1_NUM7_Pos);
    }

    return 0;
}



/**
  * @brief  SM2 digital signature generation.
  * @param[in]  crpt        The pointer of CRYPTO module
  * @param[in]  ecc_curve   The pre-defined ECC curve.
  * @param[in]  e           e = HASH256(ZA || m)
  * @param[in]  d           The private key.
  * @param[in]  k           The selected random integer.
  * @param[out] R           R of the (R,S) pair digital signature
  * @param[out] S           S of the (R,S) pair digital signature
  * @return  0    Success.
  * @return  -1   "ecc_curve" value is invalid.
  */
int32_t SM2_Sign(CRPT_T* crpt, E_ECC_CURVE ecc_curve, char* e, char* d, char* k, char* R, char* S)
{
    uint32_t r[18];
    int32_t  i, ret = 0;

    /*
        4.	Calculate e = e (mod n)
        1)	Write the curve order and curve length to N, M registers
        2)	Write the e to X1 register and 0x0 to Y1 register.
        3)	Set MODOP(CRYPTO_ECC_CTL[12:11]) to 10
        4)	Set ECCOP(CRYPTO_ECC_CTL[10:9]) to 01
        5)	Set FSEL(CRYPTO_ECC_CTL[8]) to 1
        6)	Set START(CRYPTO_ECC_CTL[0]) to 1
        7)	Wait for BUSY(CRYPTO_ECC_STS[0]) to be cleared
        8)	Read result e from X1 registers
        9)	If e ≥ n, go to step 4
    */

    /* ECC_N = Eorder */
    clean_reg(crpt->ECC_N);
    Hex2Reg(pCurve->Eorder, crpt->ECC_N);

    /* ECC_X1 = e */
    clean_reg(crpt->ECC_X1);
    Hex2Reg(e, crpt->ECC_X1);

    /* ECC_Y1 = 0 */
    clean_reg(crpt->ECC_Y1);

    /* ECC_X1 = (ECC_X1 + ECC_Y1) (mod n) */
    run_ecc_codec(crpt, ECCOP_MODULE | MODOP_ADD);

    /* backup e */
    for(i = 0; i < 18; i++)
    {
        r[i] = crpt->ECC_X1[i];
    }


    if(ecc_init_curve(crpt, ecc_curve) != 0)
    {
        ret = -1;
    }

    if(ret == 0)
    {
        CRPT->ECC_KSCTL = 0;
        

        /*
            6.	Compute x1 = x1 (mod n), where (x1, y1) = k * G.
            1)	Write the curve parameter A, B, N and curve length M to corresponding registers
            2)	Write the prime modulus or irreducible polynomial function to N registers
            3)	Write the base point G(x, y) to X1, Y1 registers
            4)	Write the random integer k to K register
            5)	Set CURVEM (CRYPTO_ECC_CTL[31:22]) to key length
            6)	Set ECCOP(CRYPTO_ECC_CTL[10:9]) to 00
            7)	Set FSEL(CRYPTO_ECC_CTL[8]) according to used curve of prime field or binary field
            8)	Set START(CRYPTO_ECC_CTL[0]) to 1
            9)	Wait for BUSY(CRYPTO_ECC_STS[0]) to be cleared
            10)	Write the curve order and curve length to N, M registers
            11)	Write 0x0 to Y1 registers
            12)	Set MOPOP(CRYPTO_ECC_CTL[12:11]) to 10
            13)	Set ECCOP(CRYPTO_ECC_CTL[10:9]) to 01
            14)	Set MOPOP(CRYPTO_ECC_CTL[12:11]) to 10
            15)	Set START(CRYPTO_ECC_CTL[0]) to 1
            16)	Wait for BUSY(CRYPTO_ECC_STS[0]) to be cleared
            17)	Read X1 registers to get x1
        */
        
        clean_reg(crpt->ECC_K);
        Hex2Reg(k, crpt->ECC_K);

        run_ecc_codec(crpt, ECCOP_POINT_MUL);

        /* 6-(10) Write the curve order to N registers */
        clean_reg(crpt->ECC_N);
        Hex2Reg(pCurve->Eorder, crpt->ECC_N);

        clean_reg(crpt->ECC_Y1);
        run_ecc_codec(crpt, ECCOP_MODULE | MODOP_ADD);


        /*
            7.	Conpute r = (e + x1) (mod n). If r = 0 or (r + k) = n, go to step 5
            1)	Write the curve order and curve length to N, M registers according to Table 1.1 4
            2)	Write the e to X1 register and x1 to Y1 register.
            3)	Set MODOP(CRYPTO_ECC_CTL[12:11]) to 10
            4)	Set ECCOP(CRYPTO_ECC_CTL[10:9]) to 01
            5)	Set FSEL(CRYPTO_ECC_CTL[8]) to 1
            6)	Set START(CRYPTO_ECC_CTL[0]) to 1
            7)	Wait for BUSY(CRYPTO_ECC_STS[0]) to be cleared
            8)	Read result r from X1 registers
            9)	If r = 0, go to step 5
            10)	Write the curve order and curve length to N, M registers
            11)	Write the r to X1 register and k to Y1 register.
            12)	Set MODOP(CRYPTO_ECC_CTL[12:11]) to 10
            13)	Set ECCOP(CRYPTO_ECC_CTL[10:9]) to 01
            14)	Set FSEL(CRYPTO_ECC_CTL[8]) to 1
            15)	Set START(CRYPTO_ECC_CTL[0]) to 1
            16)	Wait for BUSY(CRYPTO_ECC_STS[0]) to be cleared
            17)	Read result rk from X1 registers
            18)	If rk = 0, go to step 5
        */

        clean_reg(crpt->ECC_Y1);
        
        /* Resetore e */
        for(i = 0; i < 18; i++)
        {
            crpt->ECC_Y1[i] = r[i];
        }


        run_ecc_codec(crpt, ECCOP_MODULE | MODOP_ADD);
        
        /* 7-(9) If r = 0, go to step 5. Needs to provide another K */
        /* Check if X1 all zero */
        for(i = 0; i < 18; i++)
        {
            if(crpt->ECC_X1[i])
                break;
        }
        if(i == 18)
        {
            /* k is invalid */
            return -1;
        }

        /* backup r */
        for(i = 0; i < 18; i++)
        {
            r[i] = crpt->ECC_X1[i];
        }

        /* Write k to Y1 */
        clean_reg(crpt->ECC_Y1);
        Hex2Reg(k, crpt->ECC_Y1);

        /* ECC_X1 = ECC_X1 + ECC_Y1 (mod ECC_N) = r + k (mod n)*/
        run_ecc_codec(crpt, ECCOP_MODULE | MODOP_ADD);

        /* 7-(18) If r = 0, go to step 5. Needs to provide another K */
        /* Check if X1 all zero */
        for(i = 0; i < 18; i++)
        {
            if(crpt->ECC_X1[i])
                break;
        }
        if(i == 18)
        {
            /* k is invalid */
            return -1;
        }

        /* Output R */
        Reg2Hex(pCurve->Echar, r, R);

