OpenNuvoton/M2354BSP/Library/StdDriver/src/crypto.c
        /*
            8.	Compute s = (1 + d)^-1 x (k - d × r)(mod n). If s = 0, go to step 5
            1)	Write the curve order and curve length to N, M registers
            2)	Write the d to X1 register and r to Y1 register.
            3)	Set MODOP(CRYPTO_ECC_CTL[12:11]) to 01
            4)	Set ECCOP(CRYPTO_ECC_CTL[10:9]) to 01
            5)	Set FSEL(CRYPTO_ECC_CTL[8]) to 1
            6)	Set START(CRYPTO_ECC_CTL[0]) to 1
            7)	Wait for BUSY(CRYPTO_ECC_STS[0]) to be cleared
            8)	Read temporary result dr from X1 registers
            9)	Write the curve order and curve length to N, M registers
            10)	Write the k to X1 register and dr to Y1 register.
            11)	Set MODOP(CRYPTO_ECC_CTL[12:11]) to 11
            12)	Set ECCOP(CRYPTO_ECC_CTL[10:9]) to 01
            13)	Set FSEL(CRYPTO_ECC_CTL[8]) to 1
            14)	Set START(CRYPTO_ECC_CTL[0]) to 1
            15)	Wait for BUSY(CRYPTO_ECC_STS[0]) to be cleared
            16)	Read temporary result k_dr from X1 registers
            17)	Write the curve order and curve length to N, M registers
            18)	Write the d to X1 register and 0x1 to Y1 register.
            19)	Set MODOP(CRYPTO_ECC_CTL[12:11]) to 10
            20)	Set ECCOP(CRYPTO_ECC_CTL[10:9]) to 01
            21)	Set FSEL(CRYPTO_ECC_CTL[8]) to 1
            22)	Set START(CRYPTO_ECC_CTL[0]) to 1
            23)	Wait for BUSY(CRYPTO_ECC_STS[0]) to be cleared
            24)	Read temporary result d1 from X1 registers
            25)	Write the curve order and curve length to N, M registers according to Table 1.1 4
            26)	Write the d1 to X1 register and k_dr to Y1 register.
            27)	Set MODOP(CRYPTO_ECC_CTL[12:11]) to 00
            28)	Set ECCOP(CRYPTO_ECC_CTL[10:9]) to 01
            29)	Set FSEL(CRYPTO_ECC_CTL[8]) to 1
            30)	Set START(CRYPTO_ECC_CTL[0]) to 1
            31)	Wait for BUSY(CRYPTO_ECC_STS[0]) to be cleared
            32)	Read result s from X1 registers

        */

        /* ECC_N = Eorder */
        clean_reg(crpt->ECC_N);
        Hex2Reg(pCurve->Eorder, crpt->ECC_N);

        /* ECC_X1 = d */
        clean_reg(crpt->ECC_X1);
        Hex2Reg(d, crpt->ECC_X1);

        /* Restore r. ECC_Y1 = r */
        for(i = 0; i < 18; i++)
        {
            crpt->ECC_Y1[i] = r[i];
        }

        /* ECC_X1 = dr = d x r (mod n) */
        run_ecc_codec(crpt, ECCOP_MODULE | MODOP_MUL);

        /* 8-(8) ECC_Y1 = dr */
        for(i = 0; i < 18; i++)
        {
            crpt->ECC_Y1[i] = crpt->ECC_X1[i];
        }

        /* 8-(10) ECC_X1 = k */
        clean_reg(crpt->ECC_X1);
        Hex2Reg(k, crpt->ECC_X1);

        /* 8-(16) ECC_X1 = k - dr = k - d x r (mod n) */
        run_ecc_codec(crpt, ECCOP_MODULE | MODOP_SUB);

        /* backup ECC_X1 = (k - d x r) (mod n) */
        for(i = 0; i < 18; i++)
        {
            r[i] = crpt->ECC_X1[i];
        }
        
        /* 8-(18)Write the d to X1 register and 0x1 to Y1 register. */
        clean_reg(crpt->ECC_X1);
        Hex2Reg(d, crpt->ECC_X1);

        clean_reg(crpt->ECC_Y1);
        crpt->ECC_Y1[0] = 0x1UL;

        /* ECC_X1 = ECC_X1 + ECC_Y1 = d + 1 */
        run_ecc_codec(crpt, ECCOP_MODULE | MODOP_ADD);

        /* ECC_Y1 = (k - d x r) (mod n) */
        for(i = 0; i < 18; i++)
        {
            crpt->ECC_Y1[i] = r[i];
        }

        /* 8-(26) ECC_X1 = ECC_Y1 / ECC_X1 (mod ECC_N)*/
        run_ecc_codec(crpt, ECCOP_MODULE | MODOP_DIV);

        /* Output S */
        Reg2Hex(pCurve->Echar, crpt->ECC_X1, S);

    }  /* ret == 0 */

    return ret;
}


/**
  * @brief  SM2 signature verification.
  * @param[in]  crpt        The pointer of CRYPTO module
  * @param[in]  ecc_curve   The pre-defined ECC curve.
  * @param[in]  message     The hash value of source context.
  * @param[in]  public_k1   The public key 1.
  * @param[in]  public_k2   The public key 2.
  * @param[in]  R           R of the (R,S) pair digital signature
  * @param[in]  S           S of the (R,S) pair digital signature
  * @return  0    Success.
  * @return  -1   "ecc_curve" value is invalid.
  * @return  -2   Verification failed.
  */
int32_t  SM2_Verify(CRPT_T* crpt, E_ECC_CURVE ecc_curve, char* e, char* public_k1, char* public_k2, char* R, char* S)
{
    uint32_t  r[18] = {0}, s[18] = {0}, t[18], e1[18];
    uint32_t  x[18], y[18];
    int32_t   i;

    /*
        1.	Verify that r and s are integers in the interval [1, n-1]. If not, the signature is invalid
        1)	Note that n is order, not prime modulus or irreducible polynomial function
    */

    if(is_zero(R))
        return -1;
    if(is_zero(S))
        return -1;

    /* ECC_N = n */
    clean_reg(crpt->ECC_N);
    Hex2Reg(pCurve->Eorder, crpt->ECC_N);

    /* ECC_X1 = n */
    clean_reg(crpt->ECC_X1);
    Hex2Reg(pCurve->Eorder, crpt->ECC_N);

    /* ECC_Y1 = 1 */
    clean_reg(crpt->ECC_Y1);
    crpt->ECC_Y1[0] = 1UL;

    /* ECC_X1 = ECC_X1 - ECC_Y1 = n - 1 */
    run_ecc_codec(crpt, ECCOP_MODULE | MODOP_SUB);

    /* comapre with R, S */
    Hex2Reg(R, r);
    for(i = 17; i >0; i--)
    {
        if(r[i] > crpt->ECC_X1[i])
            return -1;
        if(r[i] < crpt->ECC_X1[i])
            break;
    }
    
    Hex2Reg(S, s);
    for(i = 17; i >0; i--)
    {
        if(s[i] > crpt->ECC_X1[i])
            return -1;
        if(s[i] < crpt->ECC_X1[i])
            break;
    }

    /*
        3.	Calculate e = e (mod n)
        1)	Write the curve order and curve length to N, M registers according to Table 1.1 4
        2)	Write the e to X1 register and 0x0 to Y1 register.
        3)	Set MODOP(CRYPTO_ECC_CTL[12:11]) to 10
        4)	Set ECCOP(CRYPTO_ECC_CTL[10:9]) to 01
        5)	Set FSEL(CRYPTO_ECC_CTL[8]) to 1
        6)	Set START(CRYPTO_ECC_CTL[0]) to 1
        7)	Wait for BUSY(CRYPTO_ECC_STS[0]) to be cleared
        8)	Read result e from X1 registers
    */
    
    /* ECC_X1 = e */
    clean_reg(crpt->ECC_X1);
    Hex2Reg(e, crpt->ECC_X1);

    /* ECC_Y1 = 0 */
    clean_reg(crpt->ECC_Y1);

