OpenNuvoton/M2354BSP/Library/StdDriver/src/crypto.c
    /* ECC_X1 = (ECC_X1 + ECC_Y1) (mod n) */
    run_ecc_codec(crpt, ECCOP_MODULE | MODOP_ADD);

    /* backup e */
    for(i = 0; i < 18; i++)
    {
        e1[i] = crpt->ECC_X1[i];
    }


    /*
        4.	Compute t = r + s (mod n)
        1)	Write the curve order and curve length to N, M registers
        2)	Write the r to X1 register and s to Y1 register.
        3)	Set MODOP(CRYPTO_ECC_CTL[12:11]) to 10
        4)	Set ECCOP(CRYPTO_ECC_CTL[10:9]) to 01
        5)	Set FSEL(CRYPTO_ECC_CTL[8]) to 1
        6)	Set START(CRYPTO_ECC_CTL[0]) to 1
        7)	Wait for BUSY(CRYPTO_ECC_STS[0]) to be cleared
        8)	Read result t from X1 registers

    */

    /* ECC_X1 = r, ECC_Y1 = s */
    for(i = 0; i < 18; i++)
    {
        crpt->ECC_X1[i] = r[i];
        crpt->ECC_Y1[i] = s[i];
    }
    
    /* ECC_X1 = ECC_X1 + ECC_Y1 (mod ECC_N) = t = r + s (mod n) */
    run_ecc_codec(crpt, ECCOP_MODULE | MODOP_ADD);

    /* backup t */
    for(i = 0; i < 18; i++)
    {
        t[i] = crpt->ECC_X1[i];
    }

    /*
        5.	Compute X’ (x1’, y1’) = s * G + t * Q
        1)	Write the curve parameter A, B, N, and curve length M to corresponding registers
        2)	Write the point G(x, y) to X1, Y1 registers
        3)	Write s to K registers
        4)	Set ECCOP(CRYPTO_ECC_CTL[10:9]) to 00
        5)	Set START(CRYPTO_ECC_CTL[0]) to 1
        6)	Wait for BUSY(CRYPTO_ECC_STS[0]) to be cleared
        7)	Read X1, Y1 registers to get s*G
        8)	Write the curve parameter A, B, N, and curve length M to corresponding registers
        9)	Write the public key Q(x,y) to X1, Y1 registers
        10)	Write t to K registers
        11)	Set ECCOP(CRYPTO_ECC_CTL[10:9]) to 00
        12)	Set START(CRYPTO_ECC_CTL[0]) to 1
        13)	Wait for BUSY(CRYPTO_ECC_STS[0]) to be cleared
        14)	Write the curve parameter A, B, N, and curve length M to corresponding registers
        15)	Write the result data s*G to X2, Y2 registers
        16)	Set ECCOP(CRYPTO_ECC_CTL[10:9]) to 10
        17)	Set START(CRYPTO_ECC_CTL[0]) to 1
        18)	Wait for BUSY(CRYPTO_ECC_STS[0]) to be cleared
        19)	Read X1, Y1 registers to get X’(x1’, y1’)
        20)	Write the curve order and curve length to N, M registers
        21)	Write x1’ to X1 registers
        22)	Write 0x0 to Y1 registers
        23)	Set MOPOP(CRYPTO_ECC_CTL[12:11]) to 10
        24)	Set ECCOP(CRYPTO_ECC_CTL[10:9]) to 01
        25)	Set START(CRYPTO_ECC_CTL[0]) to 1
        26)	Wait for BUSY(CRYPTO_ECC_STS[0]) to be cleared
        27)	Read X1 registers to get x1’ (mod n)
    */
    
    /*
     *  5-(1) Write the curve parameter A, B, N, and curve length M to corresponding registers
     *  5-(2) Write the point G(x, y) to X1, Y1 registers
     */
    if(ecc_init_curve(crpt, ecc_curve) < 0)
        return -1;

    /* 5-(3) ECC_K = s */
    for(i = 0; i < 18; i++)
    {
        crpt->ECC_K[i] = s[i];
    }

    /* ECC_X1, ECC_X2 = s * G */
    run_ecc_codec(crpt, ECCOP_POINT_MUL);

    /* 5-(7) Read X1, Y1 registers to get s*G */
    /* backup s * G */
    for(i = 0; i < 18; i++)
    {
        x[i] = crpt->ECC_X1[i];
        y[i] = crpt->ECC_Y1[i];
    }
    
    /* 5-(8) Write the curve parameter A, B, N, and curve length M to corresponding registers */
    if(ecc_init_curve(crpt, ecc_curve) < 0)
        return -1;

    /* 5-(9) Write the public key Q(x,y) to X1, Y1 registers */
    /* ECC_X1 = public key 1 */
    clean_reg(crpt->ECC_X1);
    Hex2Reg(public_k1, crpt->ECC_X1);
    
    /* ECC_Y1 = public key 2 */
    clean_reg(crpt->ECC_Y1);
    Hex2Reg(public_k2, crpt->ECC_Y1);

    /* 5-(10) Write t to K registers */
    /* Restore t to ECC_K */
    for(i = 0; i < 18; i++)
    {
        crpt->ECC_K[i] = t[i];
    }

    /* ECC_X1, ECC_X2 = t * Q */
    run_ecc_codec(crpt, ECCOP_POINT_MUL);

    /* 5-(14) Write the curve parameter A, B, N, and curve length M to corresponding registers */
    clean_reg(crpt->ECC_A);
    Hex2Reg(pCurve->Ea, crpt->ECC_A);

    clean_reg(crpt->ECC_B);
    Hex2Reg(pCurve->Eb, crpt->ECC_B);

    /* 5-(15) Write the result data s * G to X2, Y2 registers */
    for(i = 0; i < 18; i++)
    {
        crpt->ECC_X2[i] = x[i];
        crpt->ECC_Y2[i] = y[i];
    }
        
    /* X’ (x1’, y1’) = s * G + t * Q */
    run_ecc_codec(crpt, ECCOP_POINT_ADD);

    /* 5-(19) Read X1, Y1 registers to get X’(x1’, y1’) */
    /* ECC_X1 = x1' */
    /* ECC_Y1 = y1' */

    /* 5-(20) Write the curve order and curve length to N, M registers */
    clean_reg(crpt->ECC_N);
    Hex2Reg(pCurve->Eorder, crpt->ECC_N);

    /* 5-(22) Write 0x0 to Y1 registers */
    clean_reg(crpt->ECC_Y1);

    /* ECC_X1 = x1' (mod n) */
    run_ecc_codec(crpt, ECCOP_MODULE | MODOP_ADD);

    /* Restore e to ECC_Y1 */
    for(i = 0; i < 18; i++)
    {
        crpt->ECC_Y1[i] = e1[i];
    }

    /* R = e + x1' (mod n) */
    run_ecc_codec(crpt, ECCOP_MODULE | MODOP_ADD);

    /* Compare R and r */
    for(i = 0; i < 18; i++)
    {
        if(crpt->ECC_X1[i] != r[i])
            return -2;
    }
    
    return 0;
}



/**
  * @brief  SM3 hash calculation
  * @param[in]  pu32Addr    Address of source data
  * @param[in]  u32Size     Size of the data
  * @param[in]  digest      Hash output
  * @return  0    Success.
  * @return  -1   Fail
  */
int32_t SM3(uint32_t* pu32Addr, uint32_t u32Size, uint32_t digest[])
{
    int32_t i;
    int32_t timeout;

    /* Reset Crypto for SM3 */
    SYS->IPRST0 |= SYS_IPRST0_CRPTRST_Msk;
    SYS->IPRST0 ^= SYS_IPRST0_CRPTRST_Msk;

    /* Set DMA source and count */
    CRPT->HMAC_SADDR = (uint32_t)pu32Addr;
    CRPT->HMAC_DMACNT = u32Size;

    /* Init SHA with SM3 enabled */
    CRPT->HMAC_CTL = (SHA_MODE_SHA256 << CRPT_HMAC_CTL_OPMODE_Pos) |
        CRPT_HMAC_CTL_INSWAP_Msk | CRPT_HMAC_CTL_OUTSWAP_Msk |
        CRPT_HMAC_CTL_DMAEN_Msk | CRPT_HMAC_CTL_DMALAST_Msk |
        CRPT_HMAC_CTL_SM3EN_Msk;

    /* Trigger to start SHA processing */
    CRPT->HMAC_CTL |= CRPT_HMAC_CTL_START_Msk;

    timeout = SystemCoreClock;
    while((CRPT->INTSTS & CRPT_INTSTS_HMACIF_Msk) == 0)
    {
        if(timeout-- <= 0)
            return -1; // timeout
    }

    if(CRPT->INTSTS & CRPT_INTSTS_HMACEIF_Msk)
        return -1; // Calculation fail

    /* return hash results */
    for(i = 0; i < 8; i++)
        digest[i] = CRPT->HMAC_DGST[i];

    return 0;
}


/**@}*/ /* end of group CRYPTO_EXPORTED_FUNCTIONS */

/**@}*/ /* end of group CRYPTO_Driver */

/**@}*/ /* end of group Standard_Driver */
